#-------------------------------------------------------------------------------
# Purpose:     2021 Prof. Zoh's Work     "착하게 살지 말자."
# Author:      Cho
# Created:     2021-05-17
#-------------------------------------------------------------------------------


Pmap={}

Pmap[(11,23)]="제도관"
Pmap[(34,17)]="학생식당"
Pmap[(61, 5)]="조환규"
Pmap[(55,31)]="언어연구원"
Pmap[(11,64)]="사회관"
Pmap[(11,17)]="도서관"
Pmap[(80,60)]="온죽정"

Pmap[( 1, 2)]=[]        # 하나이상 저장할 수 있음
Pmap[( 1, 2)].append( "본관" )
Pmap[( 1, 2)].append( "서관" )


for w in Pmap :
    print(f" {w=}, {Pmap[w]=} ")


